import 'package:numerology/utils/enums.dart';

Map<int, String> arkans = {
  1: """Человек с энергией Мага обладает неординарным взглядом на жизнь, амбициозностью и уверенностью в себе. Он находчив, инициативен и решителен, не боится ставить грандиозные цели и уверенно идет к их достижению. Природа наделяет его способностями, а Вселенная предоставляет множество возможностей. 

В позитивном состоянии такой человек амбициозен, игнорирует негатив и скептицизм, успешно реализует задуманное благодаря поддержке Вселенной. Он обладает созидательным началом, любит познавать мир, путешествовать и экспериментировать. Маг активен, энергичен, излучает позитив и мотивирует окружающих. Его лидерские качества, острый ум и внутренняя энергия помогают организовывать и мотивировать людей. 

В негативном состоянии человек с энергией Мага может потерять веру в себя, что приводит к снижению энергии и уменьшению возможностей. Отсутствие цели вызывает деградацию и недовольство жизнью. Тщеславие и беспринципность могут привести к использованию любых средств для достижения власти и признания. Потребительское отношение к людям может испортить личные и рабочие отношения. Достижение целей иногда приводит к разочарованию и депрессии, которая длится до появления новой цели.
""",
  2: """Человек со второй энергией отличается глубокой мудростью, проницательностью и богатым жизненным опытом. Он окутан тайной, не раскрывая всего о себе, и обладает удивительной интуицией, позволяющей ему видеть людей насквозь и принимать верные, хотя порой нелогичные решения. Этот человек умеет внимательно слушать, понимает многое без слов и дает ценные, своевременные советы. 

В позитивном состоянии он проявляет мудрость и интуицию, принимая мир таким, какой он есть, и умея сострадать. Его жизненный опыт помогает распознавать знаки Вселенной, а при принятии решений он больше полагается на интуицию, чем на логику. Вокруг него создается ореол тайны, и считается, что такие люди обладают особым талантом к гаданиям и магии. Они сохраняют спокойствие и проницательность даже в сложных ситуациях, умея отделять мимолетные эмоции от глубоких чувств. Самодостаточность позволяет им редко пускать других в свою жизнь, но они не любят быть совсем одни. Такие люди часто носят "маску" на публике и раскрываются только дома, любят читать и разбираются в хорошей литературе. Они обладают дипломатическими способностями, вызывая необъяснимую симпатию у окружающих и умея находить общий язык с людьми и животными. Предпочитают роль теневого лидера, умело управляя ситуацией из-за кулис. 

В негативном состоянии человек со второй энергией может проявлять примитивный взгляд на мир, упрощая его до крайностей и принимая абсурдные решения. Он может стать пассивным, долго наблюдая за ситуацией без вмешательства, и склонен к прокрастинации. Переменчивость в настроении, внешности и мнениях может оттолкнуть окружающих. Излишняя эмоциональность может заменить самодостаточность, приводя к болтливости, недовольству и склонности ко лжи. Со временем между таким человеком и окружающими может возникнуть незримая стена, затрудняющая построение нормальных отношений и поиск спутника жизни.""",
  3: """Третья энергия символизирует сильное женское начало, материальный достаток, комфорт и покровительство. Если энергия выпадает женщине, она может считаться воплощением Великой матери - идеальной хозяйки, жены, матери, заботящейся об окружающих и получающей помощь от высших сил. Для мужчин эта энергия означает понимание и духовную связь со всеми женщинами в роду, домовитость и готовность брать на себя ответственность и обеспечивать семью.

Состояние человека "в плюсе" характеризуется наличием женского начала, изобилием и плодородия, покровительством, роскошью и комфортом, властью и стабильностью. ऐसा человек является хранителем семейного очага, отличным хозяйком, верным супругом и ответственным родителем, имеет глубокую духовную связь со всеми женщинами, готов помочь нуждающимся и является наставником или покровителем. Он также имеет чувство вкуса и такта, прививает любовь к прекрасному, имеет власть и стабильность, но не честолюбив.

С другой стороны, состояние человека "в минусе" характеризуется непринятием женского начала, инфантильностью, нетерпением, гордыней и заносчивостью, злоупотреблением властью. Такой человек может не хотеть взрослеть, не желать брать на себя ответственность, быть инфантильным, агрессивным, недосягаемым для других, хвастаться своим положением и деньгами, и в результате терять свою суть и становиться несчастливым""",
  4: """Четвёртый аркан символизирует влиятельную личность с серьёзным социальным статусом и мощной харизмой, которая характеризуется честолюбием, рациональным подходом к делам и желанием контролировать все процессы. Император - это убеждённый прагматик с стабильным эмоциональным фоном, властный и авторитетный.

В плюсе, это энергия психологически зрелых людей, которые состоялись в жизни и умеют достичь успеха, лидеров, которые руководят, контролируют и доводят до конца, людей, которые ценят порядок, рациональность и защиту, и готовы сделать всё, чтобы их семья жила в достатке.

В минусе, энергия может развиваться в контролёра или тирана, который требует безупречного выполнения своей воли, высокомерного человека, который завышает собственную важность, или человека, который боится потерпеть неудачу. В некоторых случаях, женщина может потерять своё женское начало и стать агрессивной и манипулятивной, а близкое общение с Императором, который уходит в минус, со временем становится невозможным.
""",
  5: """Такой человек всю жизнь ищет истину и знания, придерживается традиционных взглядов и накопляет знания, влияет на умы окружающих и ищет истину. Состояние человека "в плюсе" характеризуется просветлением, накоплением и передачей знаний, авторитетом в определенной области, хранением традиций и справедливостью.

В плюсе, такой человек уверенно движется к своим целям, берет ответственность на себя, понимает свою миссию и верит себе. Он также является учителем и учеником, авторитетным специалистом, хранителем традиций и справедливым судьей.

В минусе, энергия может развиваться в внутренний конфликт, контроль, инквизиторство, бедного мудреца или отчаявшегося человека. В этом случае, человек может страдать от внутреннего давления, контролировать всех вокруг, быть одержимым собственным понятием истины, не получать достойное вознаграждение за свой труд или отказываться от своего признания.

""",
  6: """Человек с 6 энергией создает приятное впечатление в глазах окружающих, он красив, обаятелен, имеет отличный вкус и умеет поддержать разговор. Однако, он также подвержен влиянию эмоций и сиюминутных порывов, что может привести к конфликту между разумом и сердцем.

В позитивном ключе, этот человек следует велению сердца, делает правильный выбор и наполняет свою жизнь любовью. Он становится душой компании, радушным хозяином и ценителем прекрасного.

В минусе, любовь превращается в сухой расчёт, и человек становится неприятным, мнительным и высокомерным, делает неправильный выбор, становится пессимистом, живет в собственном придуманном мире, дискриминирует по внешним признакам и совершает глупые траты.""",
  7: """Человек под влиянием седьмой энергии – это энергичный и целеустремленный лидер, который всегда находится в движении. Он быстро реагирует на перемены, обладает острым умом, дисциплиной и способностью управлять людьми.

В позитивном ключе, он уверенно идет к своей цели, преодолевая любые преграды. Он сосредоточен, решителен, обладает силой воли и стремлением к победе.

Однако, в негативном проявлении, этот человек может застрять на месте, столкнувшись с трудностями. Внутренние страхи, хаотичные действия, агрессия, направленная на себя или окружающих, – все это лишает его сил и не дает двигаться дальше.""",
  8: """Человек, олицетворяющий 8 аркан, - это уравновешенная личность, не подверженная эмоциям, способная контролировать свои чувства и логически подходить к решению любых проблем. Принимая решения, он руководствуется фактами и справедливостью, как по отношению к себе, так и к окружающим. Строго следует закону и не терпит нарушений. 

В плюсе, он обладает проницательностью, разбирается в причинах событий, предвидит их развитие и стремится разобраться в мельчайших деталях. В стремлении к балансу, он старается гармонично сочетать работу, спорт, питание, карьеру и семью. Он честный и открытый, всегда держит слово, соблюдает моральные и юридические нормы, и испытывает сильное чувство вины, если вынужден нарушить свои принципы. Его отличает здравый смысл, умение справляться с эмоциями, сосредоточенность на деле и независимость от чужого мнения. Он всегда ищет правильное решение, даже если оно не самое выгодное, что делает его идеалистом в глазах окружающих.

Однако, в минусе 8 аркан может стать замкнутым, эгоистичным и погруженным в себя. Чрезмерная ответственность мешает ему принимать решения и строить успешную жизнь, а стремление контролировать не только себя, но и окружающих, негативно влияет на отношения. В глубоком "минусе" он теряет способность здраво мыслить, становится агрессивным и совершает необдуманные поступки. Наивность и доверчивость делают его уязвимым для манипуляций, что приводит к потере авторитета среди коллег и партнеров.

""",
  9: """Человек с 9 энергией - это интроверт, ценящий уединение и наслаждающийся тишиной и спокойствием. Мудрый и образованный, он обладает глубоким жизненным опытом, всегда берет на себя ответственность и умеет принимать сложные решения. Он обладает мудростью, полученной благодаря постоянному стремлению к знаниям и осмыслению мира. Его отличает глубокое погружение в выбранную область, стремление дойти до сути, а также умение слушать и давать мудрые советы. Он ценит уединение, черпая в нем силы для новых свершений, но не отстраняется от жизни и не стремится к полному одиночеству. 

Когда энергия в плюсе, он рассудителен, внимателен, способен объективно оценивать ситуации и принимать взвешенные решения. Отличается творческими талантами, отличным ораторским искусством, умением анализировать информацию и делать прогнозы, и может достичь успеха в гуманитарных науках. Для него духовный рост важнее материальных благ, он живет скромно, не гонится за модой и общественным мнением, руководствуясь собственными ценностями и принципами.

Однако, в минусе 9 аркан может стать замкнутым и отстраниться от окружающего мира, погружаясь в свои мысли и игнорируя семью и проблемы реальной жизни. Другой крайностью является страх одиночества, который может привести к окружению себя сомнительными людьми и потере собственной индивидуальности. Невостребованная мудрость может разрушать его изнутри, если он не найдет учеников или последователей, которым сможет передать свои знания. Высокомерие и упрямство мешают ему воспринимать чужие точки зрения и признавать неправоту. Недостаток внимания к физическому здоровью может привести к болезням и психологическим проблемам.
""",
  10: """Человек с 10 энергией обладает удачливостью, любит приключения, всегда весел и не унывает, полагаясь на судьбу. Интуитивно чувствует верное направление, не загадывает наперед, но надеется на положительный исход. Обычно все именно так и происходит, и окружающие считают его баловнем судьбы.

В плюсе, он позитивен, активен, любит путешествовать и менять место работы и жизни. Он доверяет судьбе, понимает, что должно произойти, и уверенно проходит все испытания. Он знает, что судьба ведет его за руку и помогает во всем. Он благодарен Вселенной за то, что у него есть, и готов делиться своей удачей с окружающими.

В минусе же, судьба все равно предоставляет ему прекрасные возможности, но он их упускает. Он никогда не бывает доволен, считает, что все достигнуто только благодаря ему. Он ленив и пассивен, не хочет ничего делать, чтобы изменить существующий порядок вещей. Он не осознает своей удачи, не доверяет интуиции, не ставит цели и не достигает их. Он часто меняет настроение, что делает его сложным для общения. В глубоком минусе он становится опасно беспечным, пренебрежительно относится к деньгам, здоровью и самой жизни, может увлечься азартными играми или встать на преступный путь.

""",
  11: """11 энергия наделяет своего владельца Силой и вместе с тем, налагает большую ответственность. У такого человека большие перспективы, он «под завязку» наполнен энергией и стремится к большим свершениям. Решителен и смел, чувствует ответственность за окружающих, всегда готов встать на их защиту. Впрочем, никогда не отказывается от земных удовольствий, поскольку находит в них дополнительный источник вдохновения. Главная задача такого человека — покорить зверя в себе, завладев его силой.

В плюсе, он стремится к большим свершениям, решителен и смел, чувствует ответственность за окружающих и готов встать на их защиту. Он также не отказывается от земных удовольствий, которые служат ему дополнительным источником вдохновения. Его главная задача - покорить своего внутреннего зверя и использовать свою силу для достижения успеха. Он может стать защитником, миротворцем и наставником.

В минусе, его сила может привести к трусливости, уставшему аскетизму, тирании и утрате веры. Он может упускать возможности, не использовать свой потенциал и становиться апатичным. Он может отказываться от удовольствий и земных радостей, что приводит к однообразной жизни и истощению энергии. Он может использовать свою силу для разрушения, а не для защиты и поддержки, что делает его путь кривым и небезопасным. Он может испытывать сожаления о прошлых ошибках, что приводит к утрате ориентиров в жизни и бесцельному применению силы. Он может потерять веру, что приводит к моральному падению и депрессии.
""",
  12: """Человек с 12 арканом обычно переживает сложные жизненные ситуации, наполненные испытаниями и жертвами. Его уникальный взгляд на мир часто не понимают окружающие. Однако он обладает способностью глубоко понимать других и всегда готов прийти на помощь. Это человек, который готов на жертвы ради своей цели или из сострадания. Он также обладает творческим даром и может осуществить себя в различных областях искусства. Но благополучие такого человека зависит от того, находится ли его энергия в положительном или отрицательном состоянии.

В положительном состоянии человек с 12 арканом обладает уникальным взглядом на мир, который иногда кажется другим, будто он не от мира сего. Его рассуждения и мировоззрение сложно понять, но он часто замечается за советами. Он также очень сострадателен и милосерден, всегда готовый поддержать и прощать. Этот человек готов на многие жертвы ради своей цели, однако важно, чтобы эти жертвы были осознанными, рациональными и не самоубийственными. В таком случае жертва превращается в выгодный обмен, когда человек теряет мало, чтобы получить много. Такой человек также обладает творческим даром, и его уникальный взгляд на мир, сочетаемый с эмпатией, интуицией и фантазией, делает его талантливым творцом. Он может реализовать себя как художник, писатель, музыкант, скульптор, архитектор и многое другое.

Однако, если человек находится в отрицательном состоянии, он может страдать от состояния опустошения и разочарования. Ему может казаться, что он не понимает жизнь и людей, и они не понимают его. Он может чувствовать себя обессиленным и не иметь главной цели. Такой человек может стать "негативным магнитом", привлекающим в свою жизнь негативные ситуации. Он может стать "пассивной жертвой", принимающей на себя обязанности жертвы и не видя другого выхода. Иногда он может пробовать убежать от реальности, прибегая к вредным привычкам, таким как алкоголь и курение.

""",
  13: """Человек, обладающий 13 энергией, всегда готов к переменам и быстро адаптируется к любой ситуации. Его присутствие само по себе инициирует изменения, и он не привык сидеть на месте. Он любит рисковать и экстримировать, но ум и проницательность помогают ему не переходить критическую грань.

Когда человек находится в положительном состоянии, он легко принимает перемены и всегда стремится к развитию. Он любит помогать другим изменяться и самостоятельно находить свой путь. 13 энергия часто меняет свою точку зрения на мир, а эти изменения приносят только пользу. Он адаптируется к любым обстоятельствам и готовится к переменам с помощью своих способностей. Он не боится рисковать и экспериментировать с новыми идеями, и именно это делает его таким уникальным человеком. Кроме того, он всегда занимается самообразованием и духовным развитием, чтобы не деградировать духовно.

Однако, когда человек находится в отрицательном состоянии, он становится пассивным и боится перемен. Он не хочет меняться сам и навязывает свои идеи другим. В таких случаях человек может стать пессимистом и испытывать невероятное давление на себя и окружающих. Также он может начать думать о смерти и своем конечном счастье. Поэтому очень важно, чтобы человек с 13 энергией всегда был в положительном состоянии, чтобы развиваться и достигать своих целей.

""",
  14: """Последовательность 14 аркана характеризуется спокойствием и уравновешенностью. Он способен находку компромиссов и умеет урегулировать любой конфликт. В душе обладатель 14 аркана очень чувствителен и имеет тонкую душевную организацию.

Когда человек находится в положительном состоянии, он излучает спокойствие и тепло, окружающим всегда приятно находиться с ним. Обладатель 14 аркана стремится к гармонии во всех сферах жизни и всегда находит положительные моменты в любой ситуации. Он вежлив, скромен, но с непременным достоинством и умеет контролировать свои эмоции.

Однако, когда человек находится в отрицательном состоянии, он теряет ощущение баланса и дисбаланс может проявиться в разных сферах жизни. Такой человек может стать аскетичным, отрешённым или даже бесчувственным. Поэтому очень важно, чтобы человек с 14 арканом всегда находился в положительном состоянии, чтобы быть спокойным и здоровым.

""",
  15: """Человек, связанный с 15 арканом, борется всю жизнь с собственными слабостями и желаниями. Эта борьба часто отнимает все силы и препятствует развитию талантов и душевных качеств. Принятие себя и отказ от борьбы могут сделать человека рабом своих желаний, в то время как полное отрицание слабостей приводит к изнурению и пустоте. Для таких людей важен баланс в моральном развитии: они должны научиться принимать и любить себя, одновременно работая над собой и управляя негативными проявлениями.

В положительном состоянии человек принимает свои желания, наслаждается жизнью, контролирует свои страсти, достигает независимости и решимости, становится победителем, мудрецом и наставником, а также искателем истины и гармонии. 

В отрицательном состоянии человек теряет контроль над эмоциями, разрушает себя, становится диктатором, зависимым и проигравшим, что приводит к депрессии, болезням и потере смысла жизни.

""",
  16: """Обладатель 16 аркана — уверенный, энергичный, упорядоченный и надежный человек, который твердо стоит на своих убеждениях и логично мыслит. Он всегда готов помочь другим и легко адаптируется к неожиданным обстоятельствам, иногда даже сам становясь причиной таких изменений. Его жизнь полна испытаний и перемен, которые он принимает как возможности для роста. 

В положительном состоянии он быстро восстанавливается после неудач, структурирует и восстанавливает процессы, проявляет твердость и устойчивость, а также становится источником помощи и энергии для других. 

Однако в отрицательном состоянии он может испытывать крушение надежд, страх перемен, разрушительные тенденции, гордыню и проблемы в отношениях, что приводит к одиночеству и потере возможностей для развития.

""",
  17: """Обладатель 17 аркана движется к своей мечте, следуя внутреннему голосу, и Вселенная поддерживает его на этом пути. Он всегда позитивен, умён и харизматичен, что привлекает к нему других людей. Рано или поздно он достигает признания и популярности, часто благодаря своей амбициозности, хотя это не обязательно связано с искусством — это может быть талантливый профессионал в любой области. 

В положительном состоянии он ясно видит свою цель и неуклонно к ней стремится, используя свой талант и харизму, принимая признание как естественный результат своей работы. Он верит в себя и находит радость в своем пути, доверяя своей интуиции. 

Однако в отрицательном состоянии он может забыть о своей мечте и жить чужой жизнью, теряя веру в себя и свою уникальность. Это может привести к чувству неполноценности или чрезмерной самооценке, что в конечном итоге может привести к унынию и пессимизму, отчуждению от окружающих.

""",
  18: """Обладатель 18 аркана обладает проницательностью и развитым воображением, что позволяет ему глубоко чувствовать и создавать. Он хорошо понимает настроения других и имеет способность материализовывать свои мысли, хотя иногда боится принимать решения и недооценивает свои способности. 

В положительном состоянии он использует свою фантазию и творчество для генерации новых идей, проявляет эмпатию и уважение к чувствам других, а также обладает способностью материализовывать свои мысли, как положительные, так и отрицательные. У него богатый внутренний мир, где он находит силы и мудрость, которыми делится с другими. 

В отрицательном состоянии он страдает от страхов и сомнений, что мешает ему развиваться и налаживать отношения. Его негативные мысли материализуются, и он предпочитает бегство от реальности, ожидая разрешения на действия и блуждая без цели, что приводит к пассивности и потере возможностей.

""",
  19: """Обладатель 19 аркана - чрезвычайно активный и амбициозный человек, быстро достигающий успеха в материальной сфере жизни. Он энергичен, трудолюбив и целеустремлен, способен эффективно управлять несколькими делами одновременно. Несмотря на сильную ориентацию на карьеру и материальные достижения, он сохраняет теплоту в отношениях с окружающими, особенно с семьей и детьми. 

В позитивном состоянии он быстро прогрессирует во всех начинаниях, легко учится и адаптируется к новым условиям, решительно преследует свои цели, энергичен и трудолюбив, успешно достигая прогресса в карьере и бизнесе. 

Однако в негативном состоянии может проявлять одержимость одним делом в ущерб всему остальному, становиться высокомерным или, наоборот, впадать в бездействие, что разрушительно влияет на его характер и достижения. Также существует риск чрезмерного корыстолюбия и скупости. Ключевым для обладателя 19 аркана является поддержание баланса между амбициями и человечностью, а также между активной деятельностью и необходимым отдыхом, чтобы избежать выгорания и сохранить позитивные аспекты своей энергии.

""",
  20: """Обладатель 20 аркана - человек, глубоко связанный с родом и человечеством в целом, обладающий природной мудростью и пониманием кармических законов. Он способен принимать сложные решения, влияющие на судьбы многих людей, и нести за них ответственность. Этот человек обладает аналитическим умом, способностью обобщать информацию и генерировать новые идеи. 

В позитивном состоянии он может стать главой семьи или рода, мудрецом и философом, вершителем судеб, учёным или изобретателем. Часто его таланты раскрываются после определённого "пробуждения", за которым следует период бурного развития. 

В негативном состоянии он может стать отщепенцем, оторванным от семьи, нерешительным скептиком, не способным принимать важные решения, или "спящим", избегающим перемен и не раскрывающим свой потенциал. Также существует риск стать несправедливым судьёй, осуждающим других, или противником прогресса, отвергающим новые идеи и технологии. Ключевым для обладателя 20 аркана является осознание своей связи с миром, принятие ответственности за свои решения и готовность к переменам и развитию своего потенциала.

""",
  21: """Обладатель 21 аркана - человек с глобальным мировоззрением, воспринимающий весь мир как свой дом. Он отличается терпимостью к различным культурам, религиям и национальностям, стремится к миру и компромиссам. Этот человек верит в идеалы и стремится сделать мир лучше, часто участвуя в глобальных проектах и вдохновляя других своими идеями. Он легко принимает новые технологии, любит путешествовать и познавать мир, общаться с разными людьми.

В позитивном состоянии такой человек миролюбив, ставит перед собой глобальные цели, верит в идеалы и способен стать духовным лидером. Он легко осваивает современные технологии и стремится к постоянному познанию мира.

Однако в негативном состоянии он может стать воинственным и нетерпимым к несправедливости, погрузиться в бесконечную рутину, уйти в мир пустых мечтаний, игнорируя реальность. Также существует риск отстать от прогресса, мыслить шаблонно и замкнуться в себе, избегая нового опыта и общения.

Ключевым для обладателя 21 аркана является сохранение баланса между глобальным мышлением и практическими действиями, между открытостью миру и сохранением собственных ценностей, между стремлением к идеалам и реалистичным подходом к жизни. Это позволит ему реализовать свой потенциал в улучшении мира, оставаясь при этом адаптированным к реальности и продолжая развиваться.

""",
  22: """Обладатель 22 аркана - позитивный и свободолюбивый человек, который любит жизнь и открыт новому опыту. Он склонен к импульсивным поступкам и ценит свободу во всех её проявлениях. Этот человек принимает мир таким, какой он есть, сочетая в себе детскую непосредственность с житейской мудростью.

В позитивном состоянии он наслаждается истинной свободой, не зависит от общественного мнения и полон оптимизма. Обладает скрытым талантом, развитой интуицией и часто бывает удачлив. Его неординарные идеи и способность легко преодолевать трудности делают его особенным.

Однако в негативном состоянии чрезмерная весёлость может скрывать внутренние проблемы. Он может стать асоциальным, избегая любых обязательств и ответственности. Без правильного направления его таланты могут остаться нереализованными, а стремление к свободе может привести к различным зависимостям. Существует риск ухода в иллюзорный мир или превращения в "фрика", чья жизнь напоминает театральное представление.

Ключевым для обладателя 22 аркана является нахождение баланса между свободой и ответственностью, между творческим самовыражением и социальной адаптацией. Важно научиться использовать свои таланты и интуицию конструктивно, не теряя при этом своей уникальности и жизнерадостности. Это позволит ему полностью раскрыть свой потенциал, оставаясь при этом гармоничной и свободной личностью""",
};



Map<RelationshipStatuses, String> mapRelationshipStatus = {
  RelationshipStatuses.lonely: "Одинок",
  RelationshipStatuses.married: "Женат",
  RelationshipStatuses.engaged: "Обручена",
  RelationshipStatuses.haveSex: "В отношениях",
};

